[
  {
    "topico": "receita bolo de chocolate simples",
    "resposta": "Bolo de Chocolate Simples: Ingredientes: 2 xícaras de farinha de trigo, 1 xícara de açúcar, 1 xícara de chocolate em pó, 1 xícara de leite, 1/2 xícara de óleo, 2 ovos, 1 colher de sopa de fermento em pó. Modo de preparo: Misture os ingredientes secos em uma tigela. Adicione os líquidos e misture até homogeneizar. Despeje em forma untada e enfarinhada e asse em forno preaquecido a 180°C por 30-40 minutos. Faça o teste do palito para verificar se está assado."
  },
  {
    "topico": "como fazer bolo de cenoura",
    "resposta": "Bolo de Cenoura: Ingredientes: 3 cenouras médias, 3 ovos, 1 xícara de óleo, 2 xícaras de açúcar, 2 xícaras de farinha de trigo, 1 colher de sopa de fermento. Modo de preparo: Bata as cenouras, ovos, óleo e açúcar no liquidificador. Transfira para uma tigela, adicione a farinha e o fermento e misture. Asse em forma untada por 40 minutos a 180°C. Para a cobertura, misture 1 xícara de chocolate em pó, 1 xícara de açúcar e 1 colher de manteiga em uma panela até ferver. Despeje sobre o bolo ainda quente."
  },
  {
    "topico": "receita bolo de fubá",
    "resposta": "Bolo de Fubá: Ingredientes: 2 xícaras de fubá, 1 xícara de farinha de trigo, 3 ovos, 2 xícaras de leite, 1 xícara de óleo, 1 colher de sopa de fermento. Modo de preparo: Bata todos os ingredientes no liquidificador até ficar homogêneo. Despeje em forma untada e asse em forno preaquecido a 180°C por 35 minutos. Sirva frio."
  },
  {
    "topico": "bolo de laranja fofinho",
    "resposta": "Bolo de Laranja Fofinho: Ingredientes: Suco de 2 laranjas, raspas da casca, 3 ovos, 2 xícaras de farinha, 1 xícara de açúcar, 1/2 xícara de óleo, 1 colher de fermento. Modo de preparo: Bata os ovos, o açúcar e o óleo. Adicione o suco e as raspas de laranja. Incorpore a farinha e o fermento. Asse por 30-40 minutos a 180°C. Para uma calda, misture suco de laranja com açúcar e regue o bolo ainda quente."
  },
  {
    "topico": "como fazer pão caseiro",
    "resposta": "Pão Caseiro: Ingredientes: 500g de farinha de trigo, 10g de fermento biológico, 1 colher de chá de sal, 1 colher de chá de açúcar, 300ml de água morna. Modo de preparo: Dissolva o fermento e o açúcar na água morna. Adicione à farinha com sal e sove por 10 minutos. Deixe descansar por 1 hora até dobrar de volume. Modele os pães, aguarde mais 30 minutos e asse a 200°C por 25 minutos."
  },
  {
    "topico": "receita bolo de milho",
    "resposta": "Bolo de Milho: Ingredientes: 1 lata de milho verde escorrido, 3 ovos, 1 xícara de leite, 1 xícara de açúcar, 1/2 xícara de óleo, 1 xícara de fubá, 1 colher de fermento. Modo de preparo: Bata todos os ingredientes no liquidificador. Despeje em forma untada e asse a 180°C por 40 minutos. Sirva frio."
  },
  {
    "topico": "bolo de banana saudável",
    "resposta": "Bolo de Banana Saudável: Ingredientes: 4 bananas maduras amassadas, 2 ovos, 1/2 xícara de aveia em flocos, 1/4 xícara de mel, 1 colher de chá de fermento, canela a gosto. Modo de preparo: Misture todos os ingredientes. Despeje em forma untada e asse a 180°C por 25 minutos. Pode adicionar nozes ou castanhas picadas para mais sabor."
  },
  {
    "topico": "como fazer brownie",
    "resposta": "Brownie: Ingredientes: 200g de chocolate meio amargo, 150g de manteiga, 3 ovos, 1 xícara de açúcar, 1/2 xícara de farinha, 1/2 xícara de cacau em pó. Modo de preparo: Derreta o chocolate com a manteiga. Misture os ovos e o açúcar. Adicione a farinha e o cacau. Asse em forma untada a 180°C por 25-30 minutos. Não asse demais para ficar com interior úmido."
  },
  {
    "topico": "receita bolo de limão",
    "resposta": "Bolo de Limão: Ingredientes: 2 xícaras de farinha, 1 xícara de açúcar, 1/2 xícara de óleo, 3 ovos, suco de 2 limões, raspas de limão, 1 colher de fermento. Modo de preparo: Misture os ingredientes e asse a 180°C por 30 minutos. Para a calda, misture suco de limão com açúcar e regue o bolo ainda quente."
  },
  {
    "topico": "bolo de café da manhã",
    "resposta": "Bolo Simples para Café da Manhã: Ingredientes: 2 xícaras de farinha, 1 xícara de açúcar, 1 xícara de leite, 1/2 xícara de óleo, 3 ovos, 1 colher de fermento. Modo de preparo: Misture tudo e asse a 180°C por 30 minutos. Pode adicionar coco ralado, canela, frutas secas ou nozes para variar."
  },
  {
    "topico": "como umedecer bolo seco",
    "resposta": "Para umedecer bolo seco: 1) Pincele calda de açúcar (açúcar dissolvido em água quente) sobre o bolo; 2) Use leite condensado diluído com um pouco de leite; 3) Regue com leite comum; 4) Use uma calda de frutas ou licor para mais sabor. Aplique enquanto o bolo ainda estiver morno para melhor absorção."
  },
  {
    "topico": "bolo sem glúten",
    "resposta": "Bolo Sem Glúten: Substitua a farinha de trigo por uma mistura de farinha de arroz, polvilho doce e amido de milho na proporção 2:1:1. Adicione 1 colher de chá de goma xantana para dar elasticidade. Ajuste a quantidade de líquido se necessário, pois farinhas sem glúten absorvem mais água."
  },
  {
    "topico": "bolo sem lactose",
    "resposta": "Bolo Sem Lactose: Use leite vegetal (amêndoas, aveia, coco) no lugar do leite comum. Substitua a manteiga por óleo vegetal ou margarina sem lactose. Chocolate sem lactose pode ser usado. Verifique todos os ingredientes para garantir que não contenham traços de lactose."
  },
  {
    "topico": "bolo de chocolate vegano",
    "resposta": "Bolo de Chocolate Vegano: Ingredientes: 1 ½ xícara de farinha, 1 xícara de açúcar, 1/3 xícara de cacau, 1 colher de chá de bicarbonato, 1/2 colher de chá de sal, 1/3 xícara de óleo, 1 colher de vinagre, 1 colher de baunilha, 1 xícara de água fria. Misture os secos, adicione os líquidos e misture. Asse a 180°C por 30 minutos."
  },
  {
    "topico": "como decorar bolo simples",
    "resposta": "Para decorar bolo simples: 1) Use uma cobertura de chocolate ganache; 2) Polvilhe açúcar de confeiteiro; 3) Use frutas frescas; 4) Use chantilly caseiro; 5) Faça desenhos com pasta americana; 6) Use confeitos coloridos. Não é necessário equipamento profissional para um visual bonito."
  },
  {
    "topico": "bolo de aniversário fácil",
    "resposta": "Bolo de Aniversário Fácil: Faça um bolo de sua preferência (chocolate, baunilha). Recheie com doce de leite, brigadeiro ou frutas. Cubra com chantilly ou buttercream. Decore com confeitos, granulados e uma mensagem de 'Parabéns' feita com chocolate ou glacê."
  },
  {
    "topico": "receita bolo de aipim",
    "resposta": "Bolo de Aipim: Ingredientes: 500g de aipim ralado, 2 xícaras de açúcar, 3 ovos, 1/2 xícara de leite de coco, 1 colher de fermento. Modo de preparo: Misture todos os ingredientes. Despeje em forma untada e asse a 180°C por 45 minutos. Sirva com queijo coalho ou café."
  },
  {
    "topico": "bolo de cenoura com cobertura de chocolate",
    "resposta": "Bolo de Cenoura com Cobertura: Siga a receita de bolo de cenoura. Para a cobertura: Em uma panela, misture 1 xícara de chocolate em pó, 1 xícara de açúcar, 1 colher de sopa de manteiga e 1/2 xícara de leite. Leve ao fogo até engrossar. Despeje sobre o bolo ainda quente."
  },
  {
    "topico": "como fazer bolo no liquidificador",
    "resposta": "A maioria dos bolos pode ser feita no liquidificador: Coloque os ingredientes líquidos primeiro (ovos, leite, óleo), depois os secos (farinha, açúcar, fermento). Bata até ficar homogêneo. Despeje na forma e asse conforme a receita. É rápido e prático, evitando sujar muitas tigelas."
  },
  {
    "topico": "bolo de chocolate com café",
    "resposta": "Bolo de Chocolate com Café: Adicione 1/2 xícara de café forte à massa do bolo de chocolate. O café intensifica o sabor do chocolate. Para a cobertura, faça um ganache de chocolate meio amargo com um pouco de café."
  }
]